In [1]:
import numpy as np
import pandas as pd
from pathlib import Path

In [2]:
pth=Path('../missouri','missouri.csv')
print(pth)
df=pd.read_csv(pth)
df.head()

..\missouri\missouri.csv

,DOC_CTRL_NUM,REPORTING_YEAR,CHEM_NAME,CITY_NAME,STATE_ABBR,TOTAL_RELEASE
0,1301200995619,2001,Lead,ELDON,MO,NaN
1,1309207804307,2009,Lead,BLOOMSDALE,MO,0.00
2,1308206372447,2008,Lead,SEDALIA,MO,NaN
3,1314212304947,2014,Lead,KANSAS CITY,MO,NaN
4,1305203614173,2005,Lead,SEDALIA,MO,0.68

In [3]:
#delete data after 2016
# df.info()
df=df.loc[(df['REPORTING_YEAR']<=2016)]
df.head()

,DOC_CTRL_NUM,REPORTING_YEAR,CHEM_NAME,CITY_NAME,STATE_ABBR,TOTAL_RELEASE
0,1301200995619,2001,Lead,ELDON,MO,NaN
1,1309207804307,2009,Lead,BLOOMSDALE,MO,0.00
2,1308206372447,2008,Lead,SEDALIA,MO,NaN
3,1314212304947,2014,Lead,KANSAS CITY,MO,NaN
4,1305203614173,2005,Lead,SEDALIA,MO,0.68

In [4]:
# make new dataset with only city_name and count of rows for each city name
dfcitydischarges=df.groupby('CITY_NAME').size()
dfcitydischarges.head()

CITY_NAME
ADVANCE       1
AMSTERDAM     1
ANDERSON      1
ARNOLD       20
AVA          16
dtype: int64

In [7]:
dfcitydischarges.to_csv('../missouri/lead_discharges_clean.csv',index=True)

In [8]:
dfcitydischarges.describe()

count    115.000000
mean      15.991304
std       24.870364
min        1.000000
25%        3.500000
50%       10.000000
75%       16.000000
max      199.000000
dtype: float64